# -- Taps --
tap "FelixKratz/formulae"                  # Tap for coloured window borders
tap "jandedobbeleer/oh-my-posh"            # Tap for Shell prompt
tap "nikitabobko/tap"                      # Tap for Tiling manager

# -- CLI tools --
brew "git"                                 # git init
brew "nvim"                                # Best editor
brew "borders"                             # Coloured window borders
brew "oh-my-posh"                          # Shell Prompt
brew "lazygit"                             # Git GUI
brew "ffmpeg"                              # Video editing (yazi)
brew "sevenzip"                            # Archive (yazi)
brew "jq"                                  # JSON query (yazi)
brew "poppler"                             # PDF render (yazi)
brew "fd"                                  # File searching (yazi)
brew "ripgrep"                             # File content searching (yazi)
brew "fzf"                                 # Interactive Searching (yazi)
brew "zoxide"                              # Smarter cd (yazi)
brew "resvg"                               # SVG preview (yazi)
brew "imagemagick"                         # Font, HEIC, and JPEG XL preview SVG preview (yazi)
brew "yazi"                                # Terminal file manager
brew "eza"                                 # Better ls
brew "television"                          # Fuzzy finder like ls

# -- Casks (GUI Apps) -- 
cask "karabiner-elements"                  # Keyboard macros and mapping
cask "displaylink"                         # Support multiple monitors on Macbook Pro
cask "aerospace"                           # Tiling manager
cask "firefox"                             # Browser
cask "google-chrome"                       # Browser
cask "wezterm"                             # Terminal
cask "raycast"                             # Better spotlight
cask "mos"                                 # Smooth mouse scrolling 
cask "hiddenbar"                           # Hide statusbar icons
cask "stats"                               # Computer statistic
cask "whatsapp"                            # Chat app
cask "telegram"                            # Chat app
cask "alt-tab"                             # Better Alt-Tab; Window Specific rather than application
cask "microsoft-outlook"                   # Email client
cask "bitwarden"                           # Password manager
cask "shottr"                              # Better screenshot tool
