# -- Taps --
tap "FelixKratz/formulae"                  # Tap for coloured window borders
tap "jandedobbeleer/oh-my-posh"            # Tap for Shell prompt
tap "nikitabobko/tap"                      # Tap for Tiling manager

# -- CLI tools --
brew "git"                                 # git init
brew "neovim", args: ["head"]              # Best editor
brew "borders"                             # Coloured window borders
brew "oh-my-posh"                          # Shell Prompt
brew "lazygit"                             # Git GUI
brew "ffmpeg"                              # Video editing (yazi)
brew "sevenzip"                            # Archive (yazi)
brew "jq"                                  # JSON query (yazi)
brew "poppler"                             # PDF render (yazi)
brew "fd"                                  # File searching (yazi)
brew "ripgrep"                             # File content searching (yazi)
brew "fzf"                                 # Interactive Searching (yazi)
brew "zoxide"                              # Smarter cd (yazi)
brew "resvg"                               # SVG preview (yazi)
brew "imagemagick"                         # Font, HEIC, and JPEG XL preview SVG preview (yazi)
brew "yazi"                                # Terminal file manager
brew "eza"                                 # Better ls
brew "television"                          # Fuzzy finder like ls
brew "tree-sitter-cli"                     # Treesitter-cli
brew "bat"                                 # Colorful cat
brew "tlrc"                                # Practical examples of CLI tools
brew "gh"                                  # Github cli
brew "git-delta"                           # Git colorful diff pager
brew "fastfetch"                           # System information tool
brew "uv"                                  # Python package and env manager

# -- Casks (GUI Apps) -- 
cask "karabiner-elements"                  # Keyboard macros and mapping
cask "displaylink"                         # Support multiple monitors on Macbook Pro
cask "aerospace"                           # Tiling manager
cask "firefox"                             # Browser
cask "google-chrome"                       # Browser
cask "wezterm"                             # Terminal
cask "raycast"                             # Better spotlight
cask "mos"                                 # Smooth mouse scrolling 
cask "hiddenbar"                           # Hide statusbar icons
cask "stats"                               # Computer statistic
cask "whatsapp"                            # Chat app
cask "telegram"                            # Chat app
cask "alt-tab"                             # Better Alt-Tab; Window Specific rather than application
cask "microsoft-outlook"                   # Email client
cask "bitwarden"                           # Password manager
cask "shottr"                              # Better screenshot tool
cask "mactex-no-gui"                       # Latex for Mac without GUI applications
cask "microsoft-excel"                     # Microsoft Excel -_-
cask "microsoft-word"                      # Microsoft Word -_-
cask "microsoft-powerpoint"                # Microsoft Powerpoint -_-
cask "zoom"                                # Zoom
cask "sioyek"                              # PDF Reader with vim-like keybinds
cask "spotify"                             # Music

# -- LSPs --
brew "lua-language-server"                 # Lua language server
brew "marksman"                            # Markdown language server
brew "ty"                                  # Python type checker and language server

# -- Formatters --
brew "stylua"                              # Lua formatter
brew "prettier"                            # Prettier formatter

# -- Linters --
brew "markdownlint-cli2"                   # Markdown linter
