tap "candid82/brew"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "lihaoyun6/tap"
tap "nikitabobko/tap"
tap "yqrashawn/goku"
brew "apache-spark"
brew "c-ares"
brew "bitwarden-cli"
brew "brew-gem"
brew "cmatrix"
brew "cpanminus"
brew "curl"
brew "displayplacer"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "geckodriver"
brew "gem-colorls"
brew "git"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "latexindent"
brew "lazygit", link: false
brew "lua"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "openjdk"
brew "pipes-sh"
brew "poppler"
brew "postgresql@16", restart_service: :changed
brew "resvg"
brew "ripgrep"
brew "scala"
brew "sevenzip"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "yqrashawn/goku/goku"
cask "aerospace"
cask "alt-tab"
cask "anki"
cask "bitwarden"
cask "coteditor"
cask "discord"
cask "displaylink"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "homerow"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mos"
cask "notion"
cask "obsidian"
cask "onedrive"
cask "protonvpn"
cask "qbittorrent"
cask "shottr"
cask "sioyek"
cask "smoothscroll"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "whatsapp"
vscode "esbenp.prettier-vscode"
vscode "goessner.mdmath"
vscode "james-yu.latex-workshop"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
