{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": ">=0.0.0"
    },
    "carvion": {
      "src": "https://github.com/zitrocode/carvion.nvim"
    },
    "codesnap.nvim": {
      "src": "https://github.com/mistricky/codesnap.nvim"
    },
    "conform": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "hooks.nvim": {
      "src": "https://github.com/xavierchen0/hooks.nvim"
    },
    "live-preview.nvim": {
      "src": "https://github.com/brianhuster/live-preview.nvim"
    },
    "mini.snippets": {
      "src": "https://github.com/nvim-mini/mini.snippets"
    },
    "mini.statusline": {
      "src": "https://github.com/nvim-mini/mini.statusline"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-view": {
      "src": "https://github.com/igorlfs/nvim-dap-view"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim"
    },
    "token": {
      "src": "https://github.com/ThorstenRhau/token"
    },
    "tv.nvim": {
      "src": "https://github.com/alexpasmantier/tv.nvim"
    },
    "vimtex": {
      "src": "https://github.com/lervag/vimtex"
    }
  }
}
